Revit 2024 API
BuiltInFailures.RevisionCloudFailures.ProhibitSwitchFromIssuedRevision Property
 Can't remove cloud from an Issued Revision.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ProhibitSwitchFromIssuedRevision { get; }
Visual Basic
Public Shared ReadOnly Property ProhibitSwitchFromIssuedRevision As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ProhibitSwitchFromIssuedRevision {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RevisionCloudFailures Class
Autodesk.Revit.DB Namespace